using System;

namespace Facade
{
    class Program
    {
        static void Main(string[] args)
        {
            /*Фасад — это структурный паттерн, который предоставляет простой (но урезанный) интерфейс
             к сложной системе объектов, библиотеке или фреймворку.
             Кроме того, что Фасад позволяет снизить общую сложность программы,
             он также помогает вынести код, зависимый от внешней системы в единственное место. 
            */
            Console.WriteLine("Hello World!");
        }
    }
}
