using System;

namespace Decorator
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
            Декоратор — это структурный паттерн, 
            который позволяет добавлять объектам новые поведения на лету, 
            помещая их в объекты-обёртки.

            Декоратор позволяет оборачивать
            объекты бесчисленное количество раз благодаря тому,
            что и обёртки, и реальные оборачиваемые объекты имеют общий интерфейс.  
             */
            Console.WriteLine("Hello World!");
        }
    }
}
