using System;

namespace Memento
{
    class Program
    {
        static void Main(string[] args)
        {
            /*Паттерн Хранитель (Memento) позволяет выносить внутреннее состояние объекта за его пределы 
             * для последующего возможного
             * восстановления объекта без нарушения принципа инкапсуляции.
  
              Когда использовать Memento?

              Когда нужно сохранить состояние объекта для возможного последующего восстановления

              Когда сохранение состояния должно проходить без нарушения принципа инкапсуляции*/
            Console.WriteLine("Hello World!");
        }
    }
}
